Repository: ShareASoftware/iotrisktool
Catalog: lib/l10n/app_*.arb
Languages: it

# appTitle
source: ETSI EN 303 645 v3.1.3 (2024-09) Threat Assessment Tool
it: Strumento di Valutazione Minacce ETSI EN 303 645 v3.1.3 (2024-09)

# pageDescription1
source: Based on Annex B, Table B.1: Use this table to identify potential threats to your IoT device and assess their risk.
it: Basato sull'Allegato B, Tabella B.1: Usa questa tabella per identificare potenziali minacce al tuo dispositivo IoT e valutarne il rischio.

# pageDescription2
source: Fill in the 'Applicable', 'Likelihood', and 'Impact' fields for each threat. The 'Risk Score' will be calculated automatically.
it: Compila i campi 'Applicabile', 'Probabilità' e 'Impatto' per ogni minaccia. Il 'Punteggio di Rischio' sarà calcolato automaticamente.

# pageDescription3
source: Note: This is a template. Please populate the data according to the requirements.
it: Nota: Questo è un modello. Si prega di popolare i dati secondo i requisiti.

# productNameLabel
source: Product Name / System Under Assessment
it: Nome Prodotto / Sistema Sotto Valutazione

# generatePdfButton
source: Generate PDF
it: Genera PDF

# shareLinkButton
source: Share Link
it: Condividi Link

# riskScoreCalculationNote
source: Risk Score Calculation: (Likelihood Score * Impact Score). If Applicable is 'No', Risk is N/A. Scores: N/A=0, Low=1, Medium=2, High=3. Risk Levels: 1-2=Low (Green), 3-4=Medium (Amber), 6-9=High (Red).
it: Calcolo Punteggio Rischio: (Punteggio Probabilità * Punteggio Impatto). Se Applicabile è 'No', Rischio è N/A. Punteggi: N/A=0, Basso=1, Medio=2, Alto=3. Livelli Rischio: 1-2=Basso (Verde), 3-4=Medio (Ambra), 6-9=Alto (Rosso).

# notesSectionTitle
source: Notes:
it: Note:

# conditionSectionTitle
source: Condition:
it: Condizione:

# featureSectionTitle
source: Feature, capability or mechanism that needs to be present for the corresponding provision to apply:
it: Funzionalità, capacità o meccanismo che deve essere presente affinché la disposizione corrispondente si applichi:

# provisionNameHeader
source: Provision Name
it: Nome Disposizione

# provisionStatusHeader
source: Provision Status
it: Stato Disposizione

# applicableHeader
source: Applicable?
it: Applicabile?

# likelihoodHeader
source: Likelihood
it: Probabilità

# impactHeader
source: Impact
it: Impatto

# statusHeader
source: Status
it: Stato

# riskScoreHeader
source: Risk Score
it: Punteggio Rischio

# notesHeader
source: Notes / Mitigation Ideas
it: Note / Idee Mitigazione

# langEnglish
source: English
it: Inglese

# langItalian
source: Italian
it: Italiano

source: Not Specified
it: Non specificato

# enterNotesHint
source: Enter notes...
it: Inserisci note...

# section_5_0_title
source: 5.0 Reporting implementation
it: 5.0 Implementazione della segnalazione

# p_5_0_1_desc
source: Reporting implementation details
it: Dettagli sull'implementazione della segnalazione

# section_5_1_title
source: 5.1 No universal default passwords
it: 5.1 Nessuna password predefinita universale

# p_5_1_1_desc
source: No universal default passwords
it: Nessuna password predefinita universale

# p_5_1_2_desc
source: Unique per-device passwords
it: Password uniche per dispositivo

# p_5_1_2A_desc
source: Password complexity
it: Complessità della password

# p_5_1_3_desc
source: Authentication mechanism strength
it: Robustezza del meccanismo di autenticazione

# p_5_1_4_desc
source: User guidance on password change
it: Guida utente sulla modifica della password

# p_5_1_5_desc
source: Brute-force mitigation
it: Mitigazione degli attacchi brute-force

# section_5_2_title
source: 5.2 Implement a means to manage reports of vulnerabilities
it: 5.2 Implementare un mezzo per gestire le segnalazioni di vulnerabilità

# p_5_2_1_desc
source: Vulnerability disclosure policy
it: Politica di divulgazione delle vulnerabilità

# p_5_2_2_desc
source: Contact point for reporting
it: Punto di contatto per le segnalazioni

# p_5_2_3_desc
source: Acknowledgement of reports
it: Conferma di ricezione delle segnalazioni

# section_5_3_title
source: 5.3 Keep software updated
it: 5.3 Mantenere il software aggiornato

# p_5_3_1_desc
source: Update policy definition
it: Definizione della politica di aggiornamento

# p_5_3_2_desc
source: Update mechanism
it: Meccanismo di aggiornamento

# p_5_3_3_desc
source: Timely updates
it: Aggiornamenti tempestivi

# p_5_3_4A_desc
source: Update availability notification
it: Notifica disponibilità aggiornamenti

# p_5_3_4B_desc
source: Automatic update option
it: Opzione di aggiornamento automatico

# p_5_3_5_desc
source: User control over updates
it: Controllo utente sugli aggiornamenti

# p_5_3_6A_desc
source: Update failure handling
it: Gestione fallimento aggiornamenti

# p_5_3_6B_desc
source: Update notification details
it: Dettagli notifica aggiornamenti

# p_5_3_7_desc
source: Update integrity verification
it: Verifica integrità aggiornamenti

# p_5_3_8_desc
source: Update authenticity verification
it: Verifica autenticità aggiornamenti

# p_5_3_9_desc
source: Rollback mechanism
it: Meccanismo di rollback

# p_5_3_10_desc
source: Secure update delivery
it: Consegna sicura degli aggiornamenti

# p_5_3_11_desc
source: Update confidentiality
it: Riservatezza degli aggiornamenti

# p_5_3_12_desc
source: Update source authentication
it: Autenticazione sorgente aggiornamenti

# p_5_3_13_desc
source: Software component inventory
it: Inventario dei componenti software

# p_5_3_14_desc
source: Handling non-updateable components
it: Gestione componenti non aggiornabili

# p_5_3_15A_desc
source: Security implications of non-updateable components
it: Implicazioni di sicurezza dei componenti non aggiornabili

# p_5_3_15B_desc
source: User information on non-updateable components
it: Informazioni utente sui componenti non aggiornabili

# p_5_3_16_desc
source: End-of-life policy
it: Politica di fine vita

# section_5_4_title
source: 5.4 Securely store sensitive security parameters
it: 5.4 Archiviare in modo sicuro i parametri di sicurezza sensibili

# p_5_4_1_desc
source: Storage protection
it: Protezione dell'archiviazione

# p_5_4_2_desc
source: Protection of hard-coded secrets
it: Protezione dei segreti hardcoded

# p_5_4_3_desc
source: Use of hardware security features
it: Uso di funzionalità di sicurezza hardware

# p_5_4_4_desc
source: Protection during transit/use
it: Protezione durante il transito/uso

# section_5_5_title
source: 5.5 Communicate securely
it: 5.5 Comunicare in modo sicuro

# p_5_5_1_desc
source: Use of secure protocols
it: Uso di protocolli sicuri

# p_5_5_2_desc
source: Protocol selection justification
it: Giustificazione della selezione del protocollo

# p_5_5_3_desc
source: Cipher suite selection
it: Selezione della suite di cifratura

# p_5_5_4_desc
source: Certificate validation
it: Validazione del certificato

# p_5_5_5_desc
source: Secure configuration changes
it: Modifiche sicure della configurazione

# p_5_5_6_desc
source: Secure transmission of critical parameters
it: Trasmissione sicura di parametri critici

# p_5_5_7_desc
source: Protection of critical parameters in transit
it: Protezione dei parametri critici in transito

# p_5_5_8_desc
source: Secure storage of communication keys
it: Archiviazione sicura delle chiavi di comunicazione

# section_5_6_title
source: 5.6 Minimize exposed attack surfaces
it: 5.6 Minimizzare le superfici di attacco esposte

# p_5_6_1_desc
source: Disable unused interfaces
it: Disabilitare interfacce non utilizzate

# p_5_6_2_desc
source: Minimize network services
it: Minimizzare i servizi di rete

# p_5_6_3_desc
source: Justification for open ports
it: Giustificazione per le porte aperte

# p_5_6_4A_desc
source: Disable debug interfaces
it: Disabilitare interfacce di debug

# p_5_6_4B_desc
source: Secure physical debug interfaces
it: Proteggere interfacce di debug fisiche

# p_5_6_5_desc
source: Limit service privileges
it: Limitare i privilegi dei servizi

# p_5_6_6_desc
source: Input validation
it: Validazione dell'input

# p_5_6_7_desc
source: Resource management
it: Gestione delle risorse

# p_5_6_8_desc
source: Secure default configuration
it: Configurazione predefinita sicura

# p_5_6_9_desc
source: Documentation of attack surface
it: Documentazione della superficie di attacco

# section_5_7_title
source: 5.7 Ensure software integrity
it: 5.7 Garantire l'integrità del software

# p_5_7_1_desc
source: Secure boot mechanism
it: Meccanismo di avvio sicuro (secure boot)

# p_5_7_2_desc
source: Runtime integrity protection
it: Protezione dell'integrità a runtime

# section_5_8_title
source: 5.8 Ensure that personal data is secure
it: 5.8 Garantire la sicurezza dei dati personali

# p_5_8_1_desc
source: Data minimization
it: Minimizzazione dei dati

# p_5_8_2_desc
source: Secure storage of personal data
it: Archiviazione sicura dei dati personali

# p_5_8_3_desc
source: Secure processing of personal data
it: Elaborazione sicura dei dati personali

# section_5_9_title
source: 5.9 Make systems resilient to outages
it: 5.9 Rendere i sistemi resilienti alle interruzioni

# p_5_9_1_desc
source: Handling network outages
it: Gestione delle interruzioni di rete

# p_5_9_2_desc
source: Handling power outages
it: Gestione delle interruzioni di corrente

# p_5_9_3_desc
source: Recovery mechanisms
it: Meccanismi di ripristino

# section_5_10_title
source: 5.10 Examine system telemetry data
it: 5.10 Esaminare i dati di telemetria del sistema

# p_5_10_1_desc
source: Telemetry data analysis
it: Analisi dei dati di telemetria

# section_5_11_title
source: 5.11 Make it easy for users to delete user data
it: 5.11 Facilitare l'eliminazione dei dati utente da parte degli utenti

# p_5_11_1_desc
source: Data deletion mechanism (device)
it: Meccanismo di eliminazione dati (dispositivo)

# p_5_11_2_desc
source: Data deletion mechanism (service)
it: Meccanismo di eliminazione dati (servizio)

# p_5_11_3_desc
source: User guidance on data deletion
it: Guida utente sull'eliminazione dei dati

# p_5_11_4_desc
source: Confirmation of deletion
it: Conferma dell'eliminazione

# section_5_12_title
source: 5.12 Make installation and maintenance of devices easy
it: 5.12 Facilitare l'installazione e la manutenzione dei dispositivi

# p_5_12_1_desc
source: Clear installation instructions
it: Istruzioni di installazione chiare

# p_5_12_2_desc
source: Clear maintenance instructions
it: Istruzioni di manutenzione chiare

# p_5_12_3_desc
source: Secure disposal instructions
it: Istruzioni per lo smaltimento sicuro

# section_5_13_title
source: 5.13 Validate input data
it: 5.13 Validare i dati di input

# p_5_13_1A_desc
source: Input validation (network)
it: Validazione dell'input (rete)

# p_5_13_1B_desc
source: Input validation (local)
it: Validazione dell'input (locale)

# section_6_title
source: 6 Data protection provisions for consumer IoT
it: 6 Disposizioni sulla protezione dei dati per l'IoT di consumo

# p_6_1_desc
source: Privacy policy
it: Informativa sulla privacy

# p_6_2_desc
source: Consent mechanism
it: Meccanismo di consenso

# p_6_3A_desc
source: Withdrawal of consent
it: Revoca del consenso

# p_6_3B_desc
source: Effect of consent withdrawal
it: Effetto della revoca del consenso

# p_6_4_desc
source: Purpose limitation (telemetry)
it: Limitazione dello scopo (telemetria)

# p_6_5_desc
source: Transparency (telemetry)
it: Trasparenza (telemetria)

# p_6_6_desc
source: Transparency (data processing)
it: Trasparenza (elaborazione dati)

# p_6_7_desc
source: Data aggregation/anonymization
it: Aggregazione/anonimizzazione dei dati

# p_6_8_desc
source: User access to data
it: Accesso ai dati da parte dell'utente

# prov_5_0_1
source: Provision 5.0-1
it: Disposizione 5.0-1

# prov_5_1_1
source: Provision 5.1-1
it: Disposizione 5.1-1

# prov_5_1_2
source: Provision 5.1-2
it: Disposizione 5.1-2

# prov_5_1_2A
source: Provision 5.1-2A
it: Disposizione 5.1-2A

# prov_5_1_3
source: Provision 5.1-3
it: Disposizione 5.1-3

# prov_5_1_4
source: Provision 5.1-4
it: Disposizione 5.1-4

# prov_5_1_5
source: Provision 5.1-5
it: Disposizione 5.1-5

# prov_5_2_1
source: Provision 5.2-1
it: Disposizione 5.2-1

# prov_5_2_2
source: Provision 5.2-2
it: Disposizione 5.2-2

# prov_5_2_3
source: Provision 5.2-3
it: Disposizione 5.2-3

# prov_5_3_1
source: Provision 5.3-1
it: Disposizione 5.3-1

# prov_5_3_2
source: Provision 5.3-2
it: Disposizione 5.3-2

# prov_5_3_3
source: Provision 5.3-3
it: Disposizione 5.3-3

# prov_5_3_4A
source: Provision 5.3-4A
it: Disposizione 5.3-4A

# prov_5_3_4B
source: Provision 5.3-4B
it: Disposizione 5.3-4B

# prov_5_3_5
source: Provision 5.3-5
it: Disposizione 5.3-5

# prov_5_3_6A
source: Provision 5.3-6A
it: Disposizione 5.3-6A

# prov_5_3_6B
source: Provision 5.3-6B
it: Disposizione 5.3-6B

# prov_5_3_7
source: Provision 5.3-7
it: Disposizione 5.3-7

# prov_5_3_8
source: Provision 5.3-8
it: Disposizione 5.3-8

# prov_5_3_9
source: Provision 5.3-9
it: Disposizione 5.3-9

# prov_5_3_10
source: Provision 5.3-10
it: Disposizione 5.3-10

# prov_5_3_11
source: Provision 5.3-11
it: Disposizione 5.3-11

# prov_5_3_12
source: Provision 5.3-12
it: Disposizione 5.3-12

# prov_5_3_13
source: Provision 5.3-13
it: Disposizione 5.3-13

# prov_5_3_14
source: Provision 5.3-14
it: Disposizione 5.3-14

# prov_5_3_15A
source: Provision 5.3-15A
it: Disposizione 5.3-15A

# prov_5_3_15B
source: Provision 5.3-15B
it: Disposizione 5.3-15B

# prov_5_3_16
source: Provision 5.3-16
it: Disposizione 5.3-16

# prov_5_4_1
source: Provision 5.4-1
it: Disposizione 5.4-1

# prov_5_4_2
source: Provision 5.4-2
it: Disposizione 5.4-2

# prov_5_4_3
source: Provision 5.4-3
it: Disposizione 5.4-3

# prov_5_4_4
source: Provision 5.4-4
it: Disposizione 5.4-4

# prov_5_5_1
source: Provision 5.5-1
it: Disposizione 5.5-1

# prov_5_5_2
source: Provision 5.5-2
it: Disposizione 5.5-2

# prov_5_5_3
source: Provision 5.5-3
it: Disposizione 5.5-3

# prov_5_5_4
source: Provision 5.5-4
it: Disposizione 5.5-4

# prov_5_5_5
source: Provision 5.5-5
it: Disposizione 5.5-5

# prov_5_5_6
source: Provision 5.5-6
it: Disposizione 5.5-6

# prov_5_5_7
source: Provision 5.5-7
it: Disposizione 5.5-7

# prov_5_5_8
source: Provision 5.5-8
it: Disposizione 5.5-8

# prov_5_6_1
source: Provision 5.6-1
it: Disposizione 5.6-1

# prov_5_6_2
source: Provision 5.6-2
it: Disposizione 5.6-2

# prov_5_6_3
source: Provision 5.6-3
it: Disposizione 5.6-3

# prov_5_6_4A
source: Provision 5.6-4A
it: Disposizione 5.6-4A

# prov_5_6_4B
source: Provision 5.6-4B
it: Disposizione 5.6-4B

# prov_5_6_5
source: Provision 5.6-5
it: Disposizione 5.6-5

# prov_5_6_6
source: Provision 5.6-6
it: Disposizione 5.6-6

# prov_5_6_7
source: Provision 5.6-7
it: Disposizione 5.6-7

# prov_5_6_8
source: Provision 5.6-8
it: Disposizione 5.6-8

# prov_5_6_9
source: Provision 5.6-9
it: Disposizione 5.6-9

# prov_5_7_1
source: Provision 5.7-1
it: Disposizione 5.7-1

# prov_5_7_2
source: Provision 5.7-2
it: Disposizione 5.7-2

# prov_5_8_1
source: Provision 5.8-1
it: Disposizione 5.8-1

# prov_5_8_2
source: Provision 5.8-2
it: Disposizione 5.8-2

# prov_5_8_3
source: Provision 5.8-3
it: Disposizione 5.8-3

# prov_5_9_1
source: Provision 5.9-1
it: Disposizione 5.9-1

# prov_5_9_2
source: Provision 5.9-2
it: Disposizione 5.9-2

# prov_5_9_3
source: Provision 5.9-3
it: Disposizione 5.9-3

# prov_5_10_1
source: Provision 5.10-1
it: Disposizione 5.10-1

# prov_5_11_1
source: Provision 5.11-1
it: Disposizione 5.11-1

# prov_5_11_2
source: Provision 5.11-2
it: Disposizione 5.11-2

# prov_5_11_3
source: Provision 5.11-3
it: Disposizione 5.11-3

# prov_5_11_4
source: Provision 5.11-4
it: Disposizione 5.11-4

# prov_5_12_1
source: Provision 5.12-1
it: Disposizione 5.12-1

# prov_5_12_2
source: Provision 5.12-2
it: Disposizione 5.12-2

# prov_5_12_3
source: Provision 5.12-3
it: Disposizione 5.12-3

# prov_5_13_1A
source: Provision 5.13-1A
it: Disposizione 5.13-1A

# prov_5_13_1B
source: Provision 5.13-1B
it: Disposizione 5.13-1B

# prov_6_1
source: Provision 6.1
it: Disposizione 6.1

# prov_6_2
source: Provision 6.2
it: Disposizione 6.2

# prov_6_3A
source: Provision 6.3A
it: Disposizione 6.3A

# prov_6_3B
source: Provision 6.3B
it: Disposizione 6.3B

# prov_6_4
source: Provision 6.4
it: Disposizione 6.4

# prov_6_5
source: Provision 6.5
it: Disposizione 6.5

# prov_6_6
source: Provision 6.6
it: Disposizione 6.6

# prov_6_7
source: Provision 6.7
it: Disposizione 6.7

# prov_6_8
source: Provision 6.8
it: Disposizione 6.8

# conditionNoteItem1
source: 3) software components are not updateable;
it: 3) i componenti software non sono aggiornabili;

# conditionNoteItem2
source: 12) an update mechanism is implemented;
it: 12) è implementato un meccanismo di aggiornamento;

# conditionNoteItem3
source: 14) the consumer IoT device has no resource constraint determined by the use case that prevents the implementation of a mechanism which makes successful brute-force attacks on authentication mechanisms via network interfaces impracticable;
it: 14) il dispositivo IoT di consumo non presenta vincoli di risorse determinati dal caso d'uso che impediscano l'implementazione di un meccanismo che renda impraticabili attacchi di forza bruta riusciti ai meccanismi di autenticazione tramite interfacce di rete;

# conditionNoteItem4
source: 15) the consumer IoT device has no resource constraint determined by the use case that prevents the implementation of an update mechanism;
it: 15) il dispositivo IoT di consumo non presenta vincoli di risorse determinati dal caso d'uso che impediscano l'implementazione di un meccanismo di aggiornamento;

# conditionNoteItem5
source: 16) existence of critical security parameters that relate to the consumer IoT device;
it: 16) esistenza di parametri di sicurezza critici relativi al dispositivo IoT di consumo;

# featureNoteItemA
source: a) passwords can be used to authenticate users against the device or for machine-to-machine authentication;
it: a) le password possono essere utilizzate per autenticare gli utenti rispetto al dispositivo o per l'autenticazione da macchina a macchina;

# featureNoteItemB
source: b) pre-installed unique per device passwords can be used to authenticate users against the device or for machine-to-machine authentication;
it: b) password uniche preinstallate per dispositivo possono essere utilizzate per autenticare gli utenti rispetto al dispositivo o per l'autenticazione da macchina a macchina;

# featureNoteItemC
source: c) cryptographic authentication mechanisms, including password based mechanisms, can be used to authenticate users against the consumer IoT device or for machine-to-machine authentication;
it: c) meccanismi di autenticazione crittografica, inclusi meccanismi basati su password, possono essere utilizzati per autenticare gli utenti rispetto al dispositivo IoT di consumo o per l'autenticazione da macchina a macchina;

# featureNoteItemD
source: d) authentication mechanisms can be used to authenticate users against the consumer IoT device;
it: d) i meccanismi di autenticazione possono essere utilizzati per autenticare gli utenti rispetto al dispositivo IoT di consumo;

# featureNoteItemE
source: e) authentication mechanisms can be used for authenticating users or devices via network interfaces;
it: e) i meccanismi di autenticazione possono essere utilizzati per autenticare utenti o dispositivi tramite interfacce di rete;

# featureNoteItemF
source: f) software components that are not immutable due to security reasons;
it: f) componenti software che non sono immutabili per motivi di sicurezza;

# featureNoteItemG
source: g) software components of the device can be updated;
it: g) i componenti software del dispositivo possono essere aggiornati;

# featureNoteItemH
source: h) automatic software updates are supported;
it: h) sono supportati gli aggiornamenti software automatici;

# featureNoteItemI
source: i) update notifications are provided when software updates are available;
it: i) vengono fornite notifiche di aggiornamento quando sono disponibili aggiornamenti software;

# featureNoteItemJ
source: j) software updates can be delivered over a network interface;
it: j) gli aggiornamenti software possono essere distribuiti tramite un'interfaccia di rete;

# featureNoteItemK
source: k) sensitive security parameters exist in persistent storage;
it: k) parametri di sicurezza sensibili esistono in memoria persistente;

# featureNoteItemL
source: l) hard-coded unique per device identities are used in the consumer IoT device for security purposes;
it: l) identità uniche per dispositivo codificate permanentemente (hard-coded) sono utilizzate nel dispositivo IoT di consumo per scopi di sicurezza;

# featureNoteItemM
source: m) critical security parameters are used for integrity or authenticity checks of software updates or for protection of communication with associated services;
it: m) parametri di sicurezza critici sono utilizzati per controlli di integrità o autenticità degli aggiornamenti software o per la protezione della comunicazione con i servizi associati;

# featureNoteItemN
source: n) the consumer IoT device allows security-relevant changes in configuration via a network interface;
it: n) il dispositivo IoT di consumo consente modifiche di configurazione rilevanti per la sicurezza tramite un'interfaccia di rete;

# featureNoteItemO
source: o) critical security parameters used by the device can be communicated outside of the device;
it: o) parametri di sicurezza critici utilizzati dal dispositivo possono essere comunicati all'esterno del dispositivo;

# featureNoteItemP
source: p) unused network or network accessible logical interfaces exist;
it: p) esistono interfacce logiche di rete o accessibili dalla rete non utilizzate;

# featureNoteItemQ
source: q) debug interfaces exist on the device;
it: q) esistono interfacce di debug sul dispositivo;

# featureNoteItemR
source: r) debug interfaces that are physical ports exist on the device;
it: r) esistono interfacce di debug che sono porte fisiche sul dispositivo;

# featureNoteItemS
source: s) secure boot or other mechanism to detect unauthorized changes to IoT device software are supported by the device;
it: s) l'avvio sicuro (secure boot) o altro meccanismo per rilevare modifiche non autorizzate al software del dispositivo IoT è supportato dal dispositivo;

# featureNoteItemT
source: t) the consumer IoT device sends personal data to associated services;
it: t) il dispositivo IoT di consumo invia dati personali ai servizi associati;

# featureNoteItemU
source: u) the consumer IoT device sends sensitive personal data to associated services;
it: u) il dispositivo IoT di consumo invia dati personali sensibili ai servizi associati;

# featureNoteItemV
source: v) the consumer IoT device includes external sensing capabilities;
it: v) il dispositivo IoT di consumo include capacità di rilevamento esterne;

# featureNoteItemW
source: w) telemetry data can be collected from consumer IoT devices and products;
it: w) i dati di telemetria possono essere raccolti da dispositivi e prodotti IoT di consumo;

# featureNoteItemX
source: x) personal data can be stored by an associated service;
it: x) i dati personali possono essere archiviati da un servizio associato;

# featureNoteItemY
source: y) the consumer IoT device processes personal data on the basis of consumers' consent;
it: y) il dispositivo IoT di consumo elabora dati personali sulla base del consenso dei consumatori;

# featureNoteItemZ
source: z) the consumer IoT device processes personal data;
it: z) il dispositivo IoT di consumo elabora dati personali;

# featureNoteItemAA
source: aa) capabilities to collect data from consumer IoT devices or to processed data on the consumer IoT device, whose purpose is solely to compute an aggregate result.
it: aa) capacità di raccogliere dati da dispositivi IoT di consumo o di elaborare dati sul dispositivo IoT di consumo, il cui scopo è unicamente quello di calcolare un risultato aggregato.
